Q.1:Create a dataset as follow in the table.

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(
{"Tid":[x for x in range(1,11)],
 "Refund" : ['Yes','No','No','Yes','No','No','Yes','No','No','No'],
"Marital Status" : ['Single','Married','Single','Married','Divorced','Married','Divorced','Single','Married','Single'],
 "Taxable Income" : ["125K", "100K", "70K", "120K", "95K", "60K", "220K", "85K", "75K", "90K"],
 "Cheat": ["No","No","No","No","Yes","No","No","Yes","No","Yes"]
 },
index = [x for x in range(10)])
df

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes         Single           125K    No
1    2     No        Married           100K    No
2    3     No         Single            70K    No
3    4    Yes        Married           120K    No
4    5     No       Divorced            95K   Yes
5    6     No        Married            60K    No
6    7    Yes       Divorced           220K    No
7    8     No         Single            85K   Yes
8    9     No        Married            75K    No
9   10     No         Single            90K   Yes

Q2: From the above table that you have created , locate row 0,4,7,8 using Dataframe

In [4]:
df_new = df.iloc[[0,4,7,8]]
df_new

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes         Single           125K    No
4    5     No       Divorced            95K   Yes
7    8     No         Single            85K   Yes
8    9     No        Married            75K    No

Q.3: Navigate the DataFrame and do the following task for the table created in question 1:

Select row from index 3 to 7.
Select row from index 4 to 8, and column 2 to 4.
Select all rows with column index 1 to 3 (include index 3 during selection).

In [6]:
df_new = df.iloc[4:8,2:4]
df_new

  Marital Status Taxable Income
4       Divorced            95K
5        Married            60K
6       Divorced           220K
7         Single            85K

In [7]:
df_new = df.iloc[1:4,1:4]
df_new

  Refund Marital Status Taxable Income
1     No        Married           100K
2     No         Single            70K
3    Yes        Married           120K

Q.4: Read a csv file and display its first five rows.

In [8]:
iris_url = "https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data"
iris_col = ["SepalLength", "SepalWidth", "PetalLength", "PetalWidth", "Class"]
iris_df = pd.read_csv(iris_url, names=iris_col)
iris_df.head()

   SepalLength  SepalWidth  PetalLength  PetalWidth        Class
0          5.1         3.5          1.4         0.2  Iris-setosa
1          4.9         3.0          1.4         0.2  Iris-setosa
2          4.7         3.2          1.3         0.2  Iris-setosa
3          4.6         3.1          1.5         0.2  Iris-setosa
4          5.0         3.6          1.4         0.2  Iris-setosa

Q.5 From the csv file (uploaded in the Q.4) delete row 4, and delete column 3.

In [9]:
iris_df_new = iris_df.drop(index=4, columns="PetalLength")
iris_df_new.head()

   SepalLength  SepalWidth  PetalWidth        Class
0          5.1         3.5         0.2  Iris-setosa
1          4.9         3.0         0.2  Iris-setosa
2          4.7         3.2         0.2  Iris-setosa
3          4.6         3.1         0.2  Iris-setosa
5          5.4         3.9         0.4  Iris-setosa

Q6: Create a sample dataset (employees.csv) containing information about employees in a company.

In [10]:
data = {
    "Employee Id": list(range(101,106)),
    "Name":["Alice","Bob","Charlie","Diana","Edward"],
    "Department": ["HR", "IT", "IT", "Marketing", "Sales"],
    "Age":[29,34,41,28,38],
    "Salary": [50000, 70000, 65000, 55000, 60000],
    "Years_of_Experience": [4, 8, 10,3, 12],
    "Joining_Date":["2020-03-15","2017-07-19", "2013-06-01", "2021-02-10", "2010-11-25"],
    "Gender": ["Female", "Male","Male","Female","Male"],
    "Bonus":[5000, 7000, 6000, 4500, 5000],
    "Rating":[4.5, 4.0, 3.8, 4.7, 3.5]
}
df_N = pd.DataFrame(data)
df_N

,Employee Id,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating
0,101,Alice,HR,29,50000,4,2020-03-15,Female,5000,4.5
1,102,Bob,IT,34,70000,8,2017-07-19,Male,7000,4.0
2,103,Charlie,IT,41,65000,10,2013-06-01,Male,6000,3.8
3,104,Diana,Marketing,28,55000,3,2021-02-10,Female,4500,4.7
4,105,Edward,Sales,38,60000,12,2010-11-25,Male,5000,3.5

a) Shape (number of rows and columns) of the DataFrame.

In [11]:
x,y = df_N.shape
print(f"rows={x}, columns={y}")

rows=5, columns=10

b) Summary of the DataFrame that includes the data types and non-null counts for each column.

In [12]:
print(df_N.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Employee Id          5 non-null      int64
 1   Name                 5 non-null      object
 2   Department           5 non-null      object
 3   Age                  5 non-null      int64
 4   Salary               5 non-null      int64
 5   Years_of_Experience  5 non-null      int64
 6   Joining_Date         5 non-null      object
 7   Gender               5 non-null      object
 8   Bonus                5 non-null      int64
 9   Rating               5 non-null      float64
dtypes: float64(1), int64(5), object(4)
memory usage: 532.0+ bytes
None

c) Generate descriptive statistics.

In [13]:
print(df_N.describe(), "\n")

       Employee Id        Age       Salary  Years_of_Experience   Bonus  \
count     5.000000   5.000000      5.00000             5.000000     5.0
mean    103.000000  34.000000  60000.00000             7.400000  5500.0
std       1.581139   5.612486   7905.69415             3.847077  1000.0
min     101.000000  28.000000  50000.00000             3.000000  4500.0
25%     102.000000  29.000000  55000.00000             4.000000  5000.0
50%     103.000000  34.000000  60000.00000             8.000000  5000.0
75%     104.000000  38.000000  65000.00000            10.000000  6000.0
max     105.000000  41.000000  70000.00000            12.000000  7000.0

         Rating
count  5.000000
mean   4.100000
std    0.494975
min    3.500000
25%    3.800000
50%    4.000000
75%    4.500000
max    4.700000

d) Display the first 5 rows and last 3 rows of the dataset.

In [14]:
print(df_N.head())
print("\n")
print(df_N.tail(3))

   Employee Id     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   2020-03-15  Female   5000     4.5
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5


   Employee Id     Name Department  Age  Salary  Years_of_Experience  \
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

e) Calculate the following statistics from the dataset:

i. The average salary of employees.

ii. The total bonus paid to all employees.

iii. The youngest employee's age.

iv. The highest performance rating.

In [15]:
print(df_N['Salary'].mean())
print(df_N['Bonus'].sum())
print(df_N['Age'].min())
print(df_N['Rating'].max())

60000.0
27500
28
4.7

f) Sort the DataFrame by the Salary column in descending order.

In [16]:
df_N['Salary'].sort_values(ascending=False)

1    70000
2    65000
4    60000
3    55000
0    50000
Name: Salary, dtype: int64

g) Add a new column that categorizes employees based on their performance rating:

i. Excellent for ratings >= 4.5

ii. Good for ratings >= 4.0 but < 4.5

iii. Average for ratings < 4.0

In [17]:
df_N["Performance"] = ["Excellent" if r>=4.5 else "Good" if 4.0<=r <4.5 else "Average" for r in df_N['Rating']]
df_N

,Employee Id,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating,Performance
0,101,Alice,HR,29,50000,4,2020-03-15,Female,5000,4.5,Excellent
1,102,Bob,IT,34,70000,8,2017-07-19,Male,7000,4.0,Good
2,103,Charlie,IT,41,65000,10,2013-06-01,Male,6000,3.8,Average
3,104,Diana,Marketing,28,55000,3,2021-02-10,Female,4500,4.7,Excellent
4,105,Edward,Sales,38,60000,12,2010-11-25,Male,5000,3.5,Average

h) Identify missing values in the DataFrame.

In [18]:
missing = df_N.isnull()
print(missing)
print("\n")
missV =df_N.isnull().sum()
print(missV)

   Employee Id   Name  Department    Age  Salary  Years_of_Experience  \
0        False  False       False  False   False                False
1        False  False       False  False   False                False
2        False  False       False  False   False                False
3        False  False       False  False   False                False
4        False  False       False  False   False                False

   Joining_Date  Gender  Bonus  Rating  Performance
0         False   False  False   False        False
1         False   False  False   False        False
2         False   False  False   False        False
3         False   False  False   False        False
4         False   False  False   False        False


Employee Id            0
Name                   0
Department             0
Age                    0
Salary                 0
Years_of_Experience    0
Joining_Date           0
Gender                 0
Bonus                  0
Rating                 0
Performance            0
dtype: int64

i) Rename the Employee_ID column to ID.

j) Find all employees who:

i. Have more than 5 years of experience.

ii. Belong to the IT department.

In [19]:
print(df_N[df_N["Years_of_Experience"]>5])
print("\n")
print(df_N[df_N["Department"] == "IT"])

   Employee Id     Name Department  Age  Salary  Years_of_Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
4          105   Edward      Sales   38   60000                   12

  Joining_Date Gender  Bonus  Rating Performance
1   2017-07-19   Male   7000     4.0        Good
2   2013-06-01   Male   6000     3.8     Average
4   2010-11-25   Male   5000     3.5     Average


   Employee Id     Name Department  Age  Salary  Years_of_Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10

  Joining_Date Gender  Bonus  Rating Performance
1   2017-07-19   Male   7000     4.0        Good
2   2013-06-01   Male   6000     3.8     Average

k) Modify the dataset by adding a new column, Tax, which deducts 10% of the Salary.

In [20]:
df_N['Tax'] = [(x/10) for x in df_N['Salary']]
df_N

,Employee Id,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating,Performance,Tax
0,101,Alice,HR,29,50000,4,2020-03-15,Female,5000,4.5,Excellent,5000.0
1,102,Bob,IT,34,70000,8,2017-07-19,Male,7000,4.0,Good,7000.0
2,103,Charlie,IT,41,65000,10,2013-06-01,Male,6000,3.8,Average,6500.0
3,104,Diana,Marketing,28,55000,3,2021-02-10,Female,4500,4.7,Excellent,5500.0
4,105,Edward,Sales,38,60000,12,2010-11-25,Male,5000,3.5,Average,6000.0

l) Save the modified DataFrame (with added columns) to a new CSV file.

In [22]:
df_N.to_csv("Employments.csv" , index=False)